app/controllers/devices_controller.rb

INSERT INTO "devices" ("created_at", "model", "name", "serial_number", "taken", "updated_at", "user", "version") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @device = Device.new(device_params)
    @device.save

UPDATE "devices" SET "user" = ?, "updated_at" = ? WHERE "devices"."id" = 1  [["user", "Artem Moroz"], ["updated_at", Fri, 13 Dec 2013 02:53:00 UTC +00:00]]
---
  def update
    @device.update(device_params)

DELETE FROM "devices" WHERE "devices"."id" = ?  [["id", 11]]
---
  def destroy
    @device.destroy

SELECT "devices".* FROM "devices" WHERE "devices"."serial_number" = 'undefined' LIMIT 1
UPDATE "devices" SET "taken" = ?, "user" = ?, "updated_at" = ? WHERE "devices"."id" = 1  [["taken", false], ["user", "Nick Smirnoff"], ["updated_at", Mon, 16 Dec 2013 20:36:13 UTC +00:00]]
---
  def update_status_taken
    @device = Device.find_by(serial_number: params[:id]);
    @device.taken = !@device.taken
    @device.user = params[:device][:user]
    @device.save